#+TITLE: Running through Audit Log with Node 
#+AUTHOR: Zach Mandeville
#+EMAIL: zz@ii.coop
#+CREATOR: ii.coop
#+DATE: September 3rd, 2018

**** DONE fooaoeu
		 CLOSED: [2018-09-03 Mon 20:28]

#+NAME: apifoo
#+BEGIN_SRC js :tangle logfilter.js 
	console.log('starting')
	// const log = require('./testList.json')
	const _ = require('/home/z/audit-log-filter/node_modules/lodash')
	// ~/x.gitconfig/node_modules/lodash') ;;
	const readline = require('readline')
	const fs = require('fs')

	var e2eLogs =  []
	var userAgents = new Set()
	var tags = new Set()
  
  var auditLogData;
  auditLogData = fs.readFileSync('/home/z/audit-log-filter/testList.json', 'utf-8')
var auditLogLines = auditLogData.split('\n')
var json = []

for (var obj of auditLogLines) {
  if (obj.length != '') {
  json.push(JSON.parse(obj))
  }
}

for (var item of json) {
  var userAgent = item.userAgent
  console.log({thing: userAgent.match(/e2e.test/)})
}

#+END_SRC

#+RESULTS: apifoo
#+begin_example
starting
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [k8s.io] Pods should be updated [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [k8s.io] Pods should be updated [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [k8s.io] Pods should be updated [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [sig-storage] EmptyDir volumes should support (root,0666,tmpfs) [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [sig-network] DNS should provide DNS for the cluster  [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [k8s.io] Probing container with readiness probe that fails should never be ready and never restart [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [sig-storage] EmptyDir volumes should support (non-root,0666,default) [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [k8s.io] Probing container should *not* be restarted with a /healthz http liveness probe [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [k8s.io] Probing container with readiness probe should not be ready before initial delay and never restart [NodeConformance] [Conformance]' ] }
{ thing: 
   [ 'e2e.test',
     index: 0,
     input: 'e2e.test/v1.13.0 (linux/amd64) kubernetes/229eced -- [sig-network] Networking Granular Checks: Pods should function for intra-pod communication: http [NodeConformance] [Conformance]' ] }
undefined
#+end_example

#+NAME: foofu
#+BEGIN_SRC js :tangle foo.js
				// const log = require('./testList.json')
				const _ = require('/home/z/audit-log-filter/node_modules/lodash')
				// ~/x.gitconfig/node_modules/lodash') ;;
				const readline = require('readline')
				const fs = require('fs')

				var e2eLogs =  []
				var userAgents = new Set()
				var tags = new Set()

				var auditLogData;
				auditLogData = fs.readFileSync('/home/z/audit-log-filter/e2e-conformance-noslow-master.audit.log', 'utf-8')
				// auditLogData = fs.readFileSync('/home/z/audit-log-filter/testList.json', 'utf-8')
			var auditLogLines = auditLogData.split('\n')
			var auditLog = []

			for (var auditLogLine of auditLogLines) {
				if (auditLogLine.includes('e2e.test/v')) {
				auditLog.push(JSON.parse(auditLogLine))
				}
			}

			for (var logEntry of auditLog) {
				var userAgent = logEntry.userAgent
				var agentTags = userAgent.match(/(\[(.*?)\])/g)
				if (agentTags) {
				for (var tag of agentTags) {
					tags.add(tag)
				 } 
			} else {
				 // console.log({otherTag: userAgent})
		}
	}
		console.log(tags)

#+END_SRC

#+RESULTS: foofu
#+begin_example
starting
Set {
  '[sig-storage]',
  '[NodeConformance]',
  '[Conformance]',
  '[sig-network]',
  '[Projection]',
  '[sig-auth]',
  '[k8s.io]',
  '[sig-apps]',
  '[StatefulSetBasic]',
  '[sig-api-machinery]',
  '[sig-cli]',
  '[sig-node]' }
undefined
#+end_example

